Reports/ЗвонкиНаКартеРоссии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Report>
		<Properties>
			<Name>ЗвонкиНаКартеРоссии</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыбранныйВариантОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/Звонки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>Звонки</Name>
			<Comment>Реестр входящих и исходящих звонков</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Comment>Дата и время выполнения звонка</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Comment>Регион внешнего абонента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Страны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Comment>Сервер телефонии</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелСерверы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Принят</Name>
					<Comment>Индикатор состоявшегося звонка</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Comment>Инициатор звонка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелВнутренние</v8:Type>
						<v8:Type>cfg:CatalogRef.ТелВнешние</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлЗаписи</Name>
					<Comment>Имя файла с записью звонка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоВходящий</Name>
					<Comment>Направление звонка</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АбонентВнешний</Name>
					<Comment>Телефон внешнего абонента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АбонентВнутренний</Name>
					<Comment>Телефон внутреннего абонента завершившего звонок</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелВнутренние</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходаОчередь</Name>
					<Comment>Под каким порядковым номером звонок помещен в очередь</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВыходаОчередь</Name>
					<Comment>Под каким порядковым номером звонок был в очереди, когода абонент прервал вызов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сигнатура</Name>
					<Comment>Сигнатура звонка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗвонкиСтатОбщая.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ЗвонкиСтатОбщая</Name>
			<Comment>Общая статистика звонков</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Разговор</Name>
					<Comment>Общая длительность разговора (сек)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ожидание</Name>
					<Comment>Общая длительность ожидания (сек)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КЦРазговор</Name>
					<Comment>Длительность разговора абонента с оператором контакт-центра (секунд)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОПРазговор</Name>
					<Comment>Длительность разговора абонента с конечным оператором (секунд)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КЦОжидание</Name>
					<Comment>Длительность ожидания абонентом ответа оператора контакт-центра (секунд)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОПОжидание</Name>
					<Comment>Длительность ожидания абонентом ответа конечного оператора (секунд)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КЦСсылка</Name>
					<Comment>Контакт-центр ответственный за звонок</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОПСсылка</Name>
					<Comment>Подразделение ответственное за звонок</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПричиныНепринят</Name>
					<Comment>Код причины несостояшегося звонка</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнициаторИсходящего</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КЦАбонент</Name>
					<Comment>Внутренний телефон оператора КЦ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелВнутренние</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Comment>Основание звонка: сигнатура интернет-заявки, задача лояльности и пр.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сигнатура</Name>
					<Comment>Сигнатура звонка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗвонкиСделки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ЗвонкиСделки</Name>
			<Comment>Звонки и сделки</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сигнатура</Name>
					<Comment>Сигнатура звонка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗвонкиЦелевые.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ЗвонкиЦелевые</Name>
			<Comment>Реестр звонков поступивших целевым операторам</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Загружен</Name>
					<Comment>Истина если запись обработана смежной учетной системой</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПроекта</Name>
					<Comment>Код группы целевых точек</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Собственный</Name>
					<Comment>Собственный целевой звонок</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаЦелевая</Name>
					<Comment>Точка для которой звонок является целевым</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиЦелевые</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сигнатура</Name>
					<Comment>Сигнатура звонка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/ЗвонкиНаКартеРоссии/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	//ПараметрыДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных;
	//ПараметрыДанных.УстановитьЗначениеПараметра("Начало", 		Период.ДатаНачала);
	//ПараметрыДанных.УстановитьЗначениеПараметра("Окончание", 	Период.ДатаОкончания);
	
	Ткст = ЭтотОбъект.ПолучитьМакет("КодыНаименованияРегионов");
	Строк = Ткст.КоличествоСтрок();
	Если Строк= 0 Тогда
		Возврат;
	КонецЕсли;
	
	//<Бизнесс-данные>
	Если ЭтотОбъект.ВыбранныйВариантОтчета = "а" Тогда
		Запрос = Новый Запрос();
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Звонки.Регион.Код КАК КодРегионаСтрокой,
		|	СУММА(1) КАК Количество
		|ПОМЕСТИТЬ ВТ01
		|ИЗ
		|	РегистрСведений.Звонки КАК Звонки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗвонкиСтатОбщая КАК Стат
		|		ПО (Стат.Сигнатура = Звонки.Сигнатура)
		|ГДЕ
		|	Звонки.Дата МЕЖДУ &Начало И &Окончание
		|	И Стат.КЦСсылка.Код = ""000000265""
		|
		|СГРУППИРОВАТЬ ПО
		|	Звонки.Регион.Код
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ01.КодРегионаСтрокой КАК КодРегиона,
		|	ВТ01.Количество КАК Количество
		|ИЗ
		|	ВТ01 КАК ВТ01
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ВТ01.Количество) КАК Макс,
		|	МИНИМУМ(ВТ01.Количество) КАК Мин,
		|	ВЫРАЗИТЬ(СРЕДНЕЕ(ВТ01.Количество) КАК ЧИСЛО(10, 0)) КАК Сред
		|ИЗ
		|	ВТ01 КАК ВТ01";
	ИначеЕсли ЭтотОбъект.ВыбранныйВариантОтчета = "б" Тогда
		Запрос = Новый Запрос();
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Звонки.Регион.Код КАК КодРегионаСтрокой,
		|	СУММА(1) КАК Количество
		|ПОМЕСТИТЬ ВТ01
		|ИЗ
		|	РегистрСведений.Звонки КАК Звонки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗвонкиСтатОбщая КАК Стат
		|		ПО (Стат.Сигнатура = Звонки.Сигнатура)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗвонкиСделки КАК Сделки
		|		ПО Звонки.Сигнатура = Сделки.Сигнатура
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗвонкиЦелевые КАК Целевые
		|		ПО Звонки.Сигнатура = Целевые.Сигнатура
		|ГДЕ
		|	Звонки.Дата МЕЖДУ &Начало И &Окончание
		|	И Стат.КЦСсылка.Код = ""000000265""
		|
		|СГРУППИРОВАТЬ ПО
		|	Звонки.Регион.Код
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ01.КодРегионаСтрокой КАК КодРегиона,
		|	ВТ01.Количество КАК Количество
		|ИЗ
		|	ВТ01 КАК ВТ01
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ВТ01.Количество) КАК Макс,
		|	МИНИМУМ(ВТ01.Количество) КАК Мин,
		|	ВЫРАЗИТЬ(СРЕДНЕЕ(ВТ01.Количество) КАК ЧИСЛО(10, 0)) КАК Сред
		|ИЗ
		|	ВТ01 КАК ВТ01";
		
	КонецЕсли;
	Запрос.УстановитьПараметр("Начало", 	Период.ДатаНачала);
	Запрос.УстановитьПараметр("Окончание",  Период.ДатаОкончания);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Звонк 	= РезультатЗапроса[1].Выгрузить();
	МинМакс	= РезультатЗапроса[2].Выгрузить();
	Макс = МинМакс[0].Макс;
	Мин	 = МинМакс[0].Мин;
	Сред = МинМакс[0].Сред;
	
	Для Каждого Зв Из Звонк Цикл
		Зв.КодРегиона = СтрЗаменить(Зв.КодРегиона, "00", "0");
		Если СтрДлина(Зв.КодРегиона) = 3 Тогда
			Зв.КодРегиона = Прав(Зв.КодРегиона, 2);
		КонецЕсли;	
	КонецЦикла;
	//</Бизнесс-данные>
	
	Регионы = Новый Структура();
	
	Ргны = Новый ТаблицаЗначений();
	Ргны.Колонки.Добавить("ИмяРегионаКратко");
	Ргны.Колонки.Добавить("ИмяРегиона");
	Ргны.Колонки.Добавить("КодРегиона");
	Ргны.Колонки.Добавить("АдресЯчейки");
	
	//Регионы = Новый Массив();
	Для i=1 По Строк Цикл
		Стр 			 = Ткст.ПолучитьСтроку(i);
		Регион 			 = СтрРазделить(Стр, ",");
		КодРегиона 	 	 = Регион[0];
		ИмяРегиона		 = Регион[1];
		ИмяРегионаКратко = Регион[2];
		Регионы.Вставить(ИмяРегионаКратко, КодРегиона);
		
		Новая = Ргны.Добавить();
		Новая.КодРегиона 		= КодРегиона;
		Новая.ИмяРегионаКратко  = ИмяРегионаКратко;
		Новая.ИмяРегиона		= ИмяРегиона;
		Попытка
			Новая.АдресЯчейки =   Регион[3];
		Исключение
			Продолжить;
		КонецПопытки;
	КонецЦикла;
	
	ТаблДок = ЭтотОбъект.ПолучитьМакет("Карта");
	
	ТаблДок.Область("r39").ЦветФона = WebЦвета.СинеСерый;
	
	Обл = ТаблДок.ПолучитьОбласть("Карта");               	
	Обл.Параметры.Заполнить(Регионы);
	
	//Обл.Область("r1c1").ЦветФона=WebЦвета.СинеСерый;
	Для Каждого Рег Из Ргны Цикл
		
		//Поиск бизнес-данных
		ЗвонкиКоличество = 0;
		ИмяРегиона = "";
		Найденная = Звонк.Найти(Рег.КодРегиона, "КодРегиона");
		Если Найденная <> Неопределено Тогда
			ЗвонкиКоличество = Найденная.Количество;
		КонецЕсли;
		
		АдресЯчейки = Рег.АдресЯчейки; 
		Если Не ЗначениеЗаполнено(АдресЯчейки) Тогда
			Продолжить;
		КонецЕсли;
		
		Цвет = Новый Цвет(0, 0, 255);
		Если 		(Макс - 0.2*Макс) 	<= ЗвонкиКоличество И  ЗвонкиКоличество <=Макс 				Тогда Цвет = Новый Цвет(255, 0, 0);		//red	
		ИначеЕсли 	(Макс - 0.8*Макс)	<= ЗвонкиКоличество И  ЗвонкиКоличество	< (Макс - 0.2*Макс)	Тогда Цвет = Новый Цвет(255, 127, 0);	//orange
		ИначеЕсли 	(Сред-0.2*Сред) 	<= ЗвонкиКоличество И  ЗвонкиКоличество	< (Макс - 0.8*Макс)	Тогда Цвет = Новый Цвет(255, 255, 0);  	//yellow			
		ИначеЕсли 	(Сред-0.8*Сред) 	<= ЗвонкиКоличество И  ЗвонкиКоличество	< (Сред-0.2*Сред) 	Тогда Цвет = Новый Цвет(0, 255, 0); 	//green
		ИначеЕсли 	(Мин+0.2*Мин)		<= ЗвонкиКоличество И  ЗвонкиКоличество	< (Сред-0.8*Сред)	Тогда Цвет = Новый Цвет(0, 0, 255);		//blue
		ИначеЕсли 	0					<= ЗвонкиКоличество И  ЗвонкиКоличество	< (Мин+0.2*Мин) 	Тогда Цвет = Новый Цвет(255,9,255); 	//purple	
		КонецЕсли;				
		Обл.Область(АдресЯчейки).ЦветФона= Цвет;
		
		Обл.Область(АдресЯчейки).Расшифровка = Рег.ИмяРегиона ;
		Обл.Область(АдресЯчейки).Параметр = Строка(ЗвонкиКоличество)+" - "+Обл.Область(АдресЯчейки).Параметр;
	КонецЦикла;
	
	ДокументРезультат.Вывести(Обл);   
	ДокументРезультат.ТолькоПросмотр = Истина;
	
	
КонецПроцедуры
